def start():
    return 'Добро пожаловать в Погодный Бот!\n' \
           'В нем можно узнать точную погоду!\n' \
           'Есть поиск по городу или по геопозиции.\n' \
           ' *Для поиску по геопозиции, необходимо предоставлять доступ к ней.\n' \
           'Пожалуйтся, пользуйтесь клавиатурой.\n' \
           'На всякий случай:\n/weather - Узнать погоду.\n/start - Вернуться в начало.'


def weather_help():
    return 'Как хочешь узнать погоду?\n' \
           '/city - Предстоит ввести название города\n' \
           '/geo - Поиск по геолокации(работает только через кнопку снизу!)\n' \
           '/back - Возврат на начало'


def wrong_text():
    return 'Что-то пошло не так.\n' \
           'Пользуйтесь клавиатурой или предложенными коммандами!\n' \
           '/start или /back'


def weather_handler_city():
    return 'Введи название города\n' \
           ' *Постарайтесь ввести правильно!'